### Plan against `dev`
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_iam_policy_document.assume_role: Reading...
aws_iam_openid_connect_provider.github_actions: Refreshing state... [id=arn:aws:iam::975050106607:oidc-provider/token.actions.githubusercontent.com]
aws_ecr_repository.lambda: Refreshing state... [id=lambda]
aws_dynamodb_table.terraform_locks: Refreshing state... [id=terraform-locks]
aws_s3_bucket.tfstate: Refreshing state... [id=luis-dibdin-terraform-state-bucket]
data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
data.aws_iam_policy_document.oidc: Reading...
data.aws_iam_policy_document.oidc: Read complete after 0s [id=467833231]
aws_iam_role.github_role: Refreshing state... [id=GitHubActionsRole]
aws_iam_role_policy.github_actions_policy: Refreshing state... [id=GitHubActionsRole:github-actions-policy]
aws_s3_bucket_versioning.enabled: Refreshing state... [id=luis-dibdin-terraform-state-bucket]
aws_s3_bucket_ownership_controls.tfstate: Refreshing state... [id=luis-dibdin-terraform-state-bucket]
aws_s3_bucket_public_access_block.tfstate: Refreshing state... [id=luis-dibdin-terraform-state-bucket]
aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=luis-dibdin-terraform-state-bucket]
aws_s3_bucket_acl.tfstate: Refreshing state... [id=luis-dibdin-terraform-state-bucket,private]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_ecr_repository.lambda will be destroyed
  # (because aws_ecr_repository.lambda is not in configuration)
  - resource "aws_ecr_repository" "lambda" {
      - arn                  = "arn:aws:ecr:eu-west-2:975050106607:repository/lambda" -> null
      - id                   = "lambda" -> null
      - image_tag_mutability = "MUTABLE" -> null
      - name                 = "lambda" -> null
      - registry_id          = "975050106607" -> null
      - repository_url       = "975050106607.dkr.ecr.eu-west-2.amazonaws.com/lambda" -> null
      - tags                 = {} -> null
      - tags_all             = {} -> null

      - encryption_configuration {
          - encryption_type = "AES256" -> null
        }

      - image_scanning_configuration {
          - scan_on_push = true -> null
        }
    }

  # aws_ecr_repository.lambda_2 will be created
  + resource "aws_ecr_repository" "lambda_2" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "test-lambda-2"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.lambda_3 will be created
  + resource "aws_ecr_repository" "lambda_3" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "test-lambda-3"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.main_lambda will be created
  + resource "aws_ecr_repository" "main_lambda" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "test-main-lambda"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 3 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/tfplan"

```

</details>

*Pusher: @luisdibdin, Action: `pull_request`, Working Directory: ./terraform, Workflow: `CI`*